# -*- mode: ruby -*-

tap 'd12frosted/emacs-plus'
tap 'caskroom/cask'
tap 'caskroom/fonts'

cask_args appdir: '/Applications'

brew 'automake'
brew 'ctags'
brew 'bash'
brew 'emacs-plus', args: ['with-cocoa', 'with-gnutls', 'with-librsvg', 'with-imagemagick', 'with-spacemacs-icon']
brew 'git'
brew 'heroku-toolbelt'
brew 'hub'
brew 'isync'
brew 'libyaml'
brew 'markdown'
brew 'node'
brew 'openssl'
brew 'postgres'
brew 'rbenv'
brew 'ripgrep'
brew 'reattach-to-user-namespace' # vim / tmux integration
brew 'redis'
brew 'the_silver_searcher'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'vim'
brew 'w3m'
brew 'gpg'
brew 'pinentry-mac'
brew 'global', args: ['with-pygments', 'with-ctags']
brew 'fasd'
brew 'z'
brew 'stow'
brew 'asciiquarium'
brew 'pass'
brew 'awscli'
brew 'drafter' # for apib files
brew 'mas'     # install os apps from the CLI

cask '1password'
cask 'alfred'
cask 'atom'
cask 'caffeine'
cask 'dash'
cask 'disk-inventory-x'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
cask 'karabiner-elements'
cask 'slack'
cask 'gpgtools'
cask 'font-fira-code'
cask 'font-source-code-pro'
cask 'ngrok'
cask 'postgres' # postgresapp
cask 'awareness'

cask 'shiftit'
cask 'flycut'  # clipboard history

cask 'java'
brew 'scala'

# brew 'msmtp'                     # email stuff
# brew 'mu', args: ['with-emacs']  # email stuff
# cask 'growlnotify'
# cask 'imageoptim'
# cask 'bettertouchtool'
# cask 'upterm'
# cask 'charles'                   # proxy / HTTP inspector
# cask 'cocoapacketanalyzer'
