# -*- mode: ruby -*-

tap 'd12frosted/emacs-plus'
tap 'caskroom/cask'
tap 'caskroom/fonts'

cask_args appdir: '/Applications'

brew 'automake'
brew 'ctags'
brew 'bash'
brew 'emacs-plus', args: ['with-cocoa', 'with-gnutls', 'with-librsvg', 'with-imagemagick', 'with-spacemacs-icon']
brew 'git'
brew 'heroku-toolbelt'
brew 'hub'
brew 'isync'
brew 'libyaml'
brew 'markdown'
# brew 'msmtp'
brew 'mu', args: ['with-emacs']
brew 'node'
brew 'openssl'
brew 'postgres'
brew 'rbenv'
brew 'ripgrep'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'the_silver_searcher'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'vim'
brew 'w3m'
brew 'gpg'
brew 'pinentry-mac'
brew 'global', args: ['with-pygments', 'with-ctags']

cask '1password'
cask 'alfred'
cask 'atom'
# cask 'bettertouchtool'
cask 'caffeine'
# cask 'charles'
# cask 'cocoapacketanalyzer'
cask 'dash'
cask 'disk-inventory-x'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'growlnotify'
# cask 'imageoptim'
cask 'iterm2'
cask 'karabiner-elements'
cask 'slack'
cask 'shiftit'
cask 'pgptools'
cask 'font-fira-code'
cask 'font-source-code-pro'
